# Install GNU core utilities (those that come with macOS are outdated).
brew "coreutils"
brew "curl"

# Install some other useful utilities like `sponge`.
brew "moreutils"
brew "findutils"

# Install a modern version of Bash.
brew "bash"
brew "bash-completion"

# ZSH
brew "zsh"
brew "fzf" 

# Install `wget` with IRI support.
brew "wget"

# Install GnuPG to enable PGP-signing commits.
brew "gnupg"
cask "gpg-suite"

# Install more recent versions of some macOS tools.
brew "grep"
brew "openssh"
cask "spotify"
brew "screen"

brew "ack"
brew "git"
brew "git-town"
brew "git-lfs"
brew "glab" # GitLab CLI
brew "maven"
brew "libpq"
brew "nvm"
brew "gh"
brew "direnv"
brew "tfenv"
brew "jq"

cask "istat-menus"
cask "slack"
cask "visual-studio-code"
cask "vlc"
cask "slack"
brew "bind"

brew "kubectl"
# kubectl version manager
brew "asdf"
brew "kubectx"