tap "microsoft/git"


# Install GNU core utilities (those that come with macOS are outdated).
brew "coreutils"

# Install some other useful utilities like `sponge`.
brew "moreutils"
brew "findutils"

# Install a modern version of Bash.
brew "bash"
brew "bash-completion"

# ZSH
brew "zsh"

# Install `wget` with IRI support.
brew "wget"

# Install GnuPG to enable PGP-signing commits.
brew "gnupg"
cask "gpg-suite"


# Install more recent versions of some macOS tools.
brew "grep"
brew "openssh"
cask "spotify"
brew "screen"

brew "ack"
brew "git"
brew "git-town"
brew "git-completions"
brew "git-lfs"
brew "glab" # GitLab CLI
brew "maven"
brew "bluesnooze"
brew "libpq"
brew "nvm"

cask "github"
cask "git-credential-manager-core"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "signal"
cask "slack"
cask "visual-studio-code"
cask "vlc"
cask "slack"
